<?php
/**
 * 开发规范：
 * 1.不同版本不同控制器以及模板
 * 2.不同版本不同数据库，但是对应数据表表结构必须一致
 * 3.不同版本共用service层，所以修改表结构必须所有版本统一
 */
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2015 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
// 检测PHP环境
/**
 * 系统默认版本是5.4，配合支付宝接口，这里启用PHP最低版本是5.5
 * modify by yqc on 2017.12.05
 */

if (version_compare(PHP_VERSION, '5.5.0', '<'))
    die('require PHP >= 5.5.0!');

// [ 应用入口文件 ]
// 定义应用目录
define('APP_PATH', __DIR__ . '/application/');
// 加载框架引导文件
require __DIR__ . '/thinkphp/start.php';


